Revit 2026 API

# RebarPropagation Class

---

An utility class containing functions that can be used to propagate rebar elements.

SystemObject Autodesk.Revit.DB.StructureRebarPropagation

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class RebarPropagation
```
```vb
Public NotInheritable Class RebarPropagation
```
```cpp
public ref class RebarPropagation abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RebarPropagation = class end
```

The RebarPropagation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AlignByFace |  |
|  | AlignByHost |  |

#### Reference

Autodesk.Revit.DB.Structure Namespace